; PopDrop 配置文件
; 修改后，在面板中点“刷新”即可重新读取。

[General]
; AutoHotkey v2 快捷键语法，例如 F3、^!Space（Ctrl+Alt+Space）、#q（Win+Q）
Hotkey=F2
; 每个文件夹展示的最新文件数量，范围 1～100
MaxFilesPerFolder=10
; 0=仅当前目录，1=包括所有子目录
IncludeSubfolders=1
; 资源管理器式缩略图边长，范围 48～256 像素
ThumbnailSize=92
; 面板打开时的宽度和高度（像素）
WindowWidth=640
WindowHeight=520
; Thumbnail=缩略图，List=文件名列表
ViewMode=Thumbnail
; 1=显示“最近打开”侧边栏，0=关闭
ShowRecentSidebar=0
; 侧边栏最多显示的系统近期文件数量
RecentFileCount=12
; 留空时使用软件目录下的 cache 文件夹；不可写时仅使用内存缓存
CachePath=
; Fast=只读已有缩略图缓存，Full=允许现场生成缩略图
ThumbnailPolicy=Full
; 窗口模式：always_on_top（默认，始终置顶）| temporary（置顶，失焦自动隐藏）| normal（普通窗口，不置顶）
WindowMode=always_on_top

; 全局文件筛选模式：All=显示所有文件，Include=仅显示扩展名列表中的文件，Exclude=排除扩展名列表中的文件

FilterMode=All
; 全局筛选扩展名列表（逗号分隔），FilterMode=All 时此选项无效
FileExtensions=

[Folders]
; 左侧为面板分组名称，右侧为目录路径。可继续增加行。
文档=%USERPROFILE%\Documents
下载=%USERPROFILE%\Downloads

; ---- 文件夹级独立配置（可选） ----

; 名称必须与 [Folders] 中的显示名称一致。
; 未配置的选项继承全局设置。
;
; 支持的参数：
;   IncludeSubfolders  0=不扫描子文件夹，1=递归扫描（继承全局）
;   MaxFilesPerFolder  该文件夹最多显示文件数，1~100（继承全局）
;   FilterMode         All / Include / Exclude / Inherit
;                      Inherit=整体继承全局筛选模式及扩展名列表
;                      All=该文件夹显示所有文件，忽略 FileExtensions
;   FileExtensions     逗号分隔的扩展名列表，仅在 Include/Exclude 时有效
;
; 示例：
;
; [Folder:下载]
;   IncludeSubfolders=0
;   MaxFilesPerFolder=12
;   FilterMode=Exclude
;   FileExtensions=.tmp,.part,.crdownload,.download
;
; [Folder:素材]
;   FilterMode=Include
;   FileExtensions=.png,.jpg,.jpeg,.webp,.gif

